<template>
  <div class="flex flex-col">
    <p>Моя история:</p>
    <div class="flex flex-row gap-4">
      <img
        class="w-[300px] h-[300px]"
        src="/img/school-photo.jpg"
        alt="Школьного фото не будет :("
      />
      <div class="w-full text-[18px] text-[#b8b6c2]">
        <p>
          В правом верхнем углу вы видите одно из моих последних селфи с
          кетчупом,я его фанат,а слева я перед заключительным годом обучения в
          школе.Похож? :D А теперь к истории...
        </p>
        <p class="indent-8">
          Еще с раннего детства мне был интересен компьютер,но помимо того чтобы
          просто в него играть,мне также интересно было как это все
          работает.Думаю все началось в момент когда я начал сам собирать себе
          сборки модов для майнкрафта и устанавливать сомнительные игры из
          интернета.Потом я также начал сам разбирать и собирать обратно свой
          старенький ПК чтобы его почистить или поставить какую-нибудь
          обновочку,так я начинал знакомиться с аппаратной частью
          компьютера.Ближе к старшим классам на уроках информатики мне стало
          довольно интересно изучать двочиную систему,какие-то основы сетей,и
          писать первые программы на паскале.Как ни странно я умудрился получить
          в 8 классе за один из семестров 2 по информатике,бывает и такое).Ближе
          к окончанию школы я не понимал кем же я все таки хочу быть и просто
          поступил в Универ чтобы продолжить искать себя там.Пробовал себя в
          музыке,но как и все мои прошлые увлечения мне это быстро надоело и я
          забросил.И вот наконец в начале второго курса мой друг позвал меня на
          стажировку в IT-компанию на роль Front-end разработчика.Тогда я еще не
          знал куда меня это приведет...
        </p>
      </div>
    </div>
  </div>
</template>
